app/views/playdates/_suggestbypref.html.haml

SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('weekends') OR LOWER(name) = LOWER('neutered') OR LOWER(name) = LOWER('male') OR LOWER(name) = LOWER('indoor'))
---
  - elsif current_user.preference_list.include?("both") && current_user.preference_list.include?("unneutered") === true
    - high_matches = User.where(neutered:false) && User.tagged_with(current_user.preference_list, :any => true)

SELECT  users.* FROM "users" WHERE (EXISTS (SELECT 1 FROM taggings users_taggings_c1cf113 WHERE users_taggings_c1cf113.taggable_id = "users".id AND users_taggings_c1cf113.taggable_type = 'User' AND users_taggings_c1cf113.tag_id in (1, 3, 9, 8)))
---
-# -User.where(neutered:false).each do |unneutered|
-# -User.where(dog_age>5).each do |young|