app/views/users/show.html.haml

- if @user.user_matches.length > 0
---
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 1

    - current_user.user_matches.each do |buddy|
      - buds = User.where(id:buddy.dog_requestee_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 13]]