app/controllers/playdates_controller.rb

SELECT "playdates".* FROM "playdates"
---
  def index
    @playdates = Playdate.all

INSERT INTO "playdates" ("name", "place", "date", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @playdate = Playdate.create(playdate_params)

SELECT  users.* FROM "users" WHERE (EXISTS (SELECT 1 FROM taggings users_taggings_c1cf113 WHERE users_taggings_c1cf113.taggable_id = "users".id AND users_taggings_c1cf113.taggable_type = 'User' AND users_taggings_c1cf113.tag_id in (1, 3, 9, 8)))
---
  def suggest
    @users = User.all