app/controllers/users_controller.rb

  def create_match
    match_fields = params[:user]
    # param_dog_requester = match_fields[0]
    # param_dog_requestee = match_fields[1]
    param_dog_requester_id = match_fields[2]
    param_dog_requestee_id = match_fields[3]
    @match = UserMatch.create(
      dog_requester_id: param_dog_requester_id,
      dog_requestee_id: param_dog_requestee_id,
      status: "pending"
      )
---
INSERT INTO "user_matches" ("dog_requester_id", "dog_requestee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dog_requester_id", 14], ["dog_requestee_id", 14], ["created_at", "2015-03-04 14:49:41.117121"], ["updated_at", "2015-03-04 14:49:41.117121"]]

  def questionnaire
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 11]]